Revit 2027 API
AnnotationSymbol.AnnotationSymbolType Property
 The AnnotationSymbol style of this AnnotationSymbol.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnnotationSymbolType AnnotationSymbolType { get; set; }
Public Property AnnotationSymbolType As AnnotationSymbolType
	Get
	Set
public:
property AnnotationSymbolType^ AnnotationSymbolType {
	AnnotationSymbolType^ get ();
	void set (AnnotationSymbolType^ value);
}
member AnnotationSymbolType : AnnotationSymbolType with get, set
Property Value
AnnotationSymbolType
Remarks
The AnnotationSymbolType property can be used to retrieve the kind of the symbol. This property can also be used to change the type of an annotation by setting it to a different type. All the annotation symbol types in the project can be found using the Document.AnnotationSymbolTypes property.
See Also
Reference
AnnotationSymbol Class
Autodesk.Revit.DB Namespace